// Даны два числа. Показать большее и меньшее число
int a = -5;
int b = 3;

if (a > b)
{
   Console.WriteLine($"Mаксимальное число равно {a}, минимальное число равно {b}");
}
else
{
   Console.WriteLine($"Mаксимальное число равно {b}, минимальное число равно {a}");
}